In [1]:
import pandas as pd
data = pd.DataFrame({"a":["one","two"]*3,
                    "b": [1,1,2,3,2,3]})
data

     a  b
0  one  1
1  two  1
2  one  2
3  two  3
4  one  2
5  two  3

In [3]:
data.duplicated()

0    False
1    False
2    False
3    False
4     True
5     True
dtype: bool

In [5]:
data.drop_duplicates()

     a  b
0  one  1
1  two  1
2  one  2
3  two  3

In [6]:
data["c"] = range(6)
data

     a  b  c
0  one  1  0
1  two  1  1
2  one  2  2
3  two  3  3
4  one  2  4
5  two  3  5

In [7]:
data.duplicated(["a","b"], keep="last")

0    False
1    False
2     True
3     True
4    False
5    False
dtype: bool

In [11]:
df = pd.DataFrame({"name": ["Tim", "tom", "Sam","Kate", "Kim"],
                  "scores":[60,50,70,80,40]})
df

   name  scores
0   Tim      60
1   tom      50
2   Sam      70
3  Kate      80
4   Kim      40

In [12]:
s = pd.Series([80,70,90,60])

In [13]:
import numpy as np

In [14]:
s.replace(90, 30)

0    80
1    70
2    30
3    60
dtype: int64

In [16]:
s.replace(90, np.nan)

0    80.0
1    70.0
2     NaN
3    60.0
dtype: float64

In [20]:
df = pd.DataFrame(np.arange(12).reshape(3,4),
                  index = [0,1,2],
                  columns=["tim","tom","kim","sam"])
df

   tim  tom  kim  sam
0    0    1    2    3
1    4    5    6    7
2    8    9   10   11

In [21]:
sc=[30,90,70,90,90,80,70]
x=[20,40,60,80,100]

In [23]:
y=pd.cut(sc,x)

In [24]:
y

[(20, 40], (80, 100], (60, 80], (80, 100], (80, 100], (60, 80], (60, 80]]
Categories (4, interval[int64, right]): [(20, 40] < (40, 60] < (60, 80] < (80, 100]]

In [25]:
y.codes

array([0, 3, 2, 3, 3, 2, 2], dtype=int8)

In [26]:
y.categories

IntervalIndex([(20, 40], (40, 60], (60, 80], (80, 100]], dtype='interval[int64, right]')

In [27]:
pd.value_counts(y)

(60, 80]     3
(80, 100]    3
(20, 40]     1
(40, 60]     0
dtype: int64

In [28]:
y = pd.ct(sc,x,right=False)

AttributeError: module 'pandas' has no attribute 'ct'